# 题１

print(''' 
          ********
          *      *
          *      *
          ********''')

# 2.
# 中国古代的秤是16两一斤，请问古代的216两是古代的几斤几两?
# 写程序打印出来


a = 216
b=16
c=a // b
d = a % b
print('古代的216两是古代的',c,'斤',d,'两')


# 3. 从凌晨0:0:0 计时，到现在已经过了 63320 秒
#      请问现在是几时，几分，几秒,写程序打印出来
#     (提示: 用地板除和求余实现)


n = 63320
h = 63320 // 3600
m = (n - h * 3600) // 60
s = n - h * 3600 - 60 * m
print('现在是',h,'时',m,'分',s,'秒')

# 4.
# 温度转换:
# 摄氏温度 = 5.0 / 9.0 * (华氏温度 - 32)
# 开氏温度 = 摄氏温度 + 273.15
# 问:
# 100
# 华氏温度转为摄低温度是多少度，转为开氏温度是多少度?


c = 5 / 9 * (100-32)
k = c + 273.15

print('100华氏温度转为摄低温度是%.3f度转为开氏温度是%.3f度'% (c,k))


